espressif/esp-idf/components/esp_rom/test_apps/linux_rom_apis/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=n
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
